import React from 'react'
import styles from './Masters.module.scss'
import Button from '../UI/Button/Button'

const masters = [
	{
		id: 1,
		image: require('../../img/car1.jpg'),
		alt: 'master1',
		nameMaster: 'Соловьева Анастасия',
		location: 'м. Таганская',
		description:
			'Закончила с отличием Московский Медицинский колледж #5 по специальности сестринское дело. Прошла профессиональную переподготовку в учебном центре «Орхидея» по программе Косметология. Дополнительно проходила курсы и получала сертификаты на работе с лазерами.',
	},
	{
		id: 2,
		image: require('../../img/car2.jpg'),
		alt: 'master2',
		nameMaster: 'Супрунова Аксинья',
		location: 'м. Павелецкая',
		description:
			'Закончила МГМСУ имени А. И. Евдокимова, имеется опыт работы в медицине и косметологии более 3 лет. Готова развиваться в своей сфере вместе Вами! Жду Вас у себя на процедуре! К работе подхожу ответственно, к каждой девушке ищу индивидуальный подход для создания приятной деликатной атмосферы.',
	},
	{
		id: 3,
		image: require('../../img/car3.jpeg'),
		alt: 'master3',
		nameMaster: 'Антоненко Екатерина',
		location: 'м. Новослободская',
		description:
			'Добрая и позитивная, имеет опыт работы на диодных и гибридных лазерах, знает всё о вашей коже и волосах, идеально подберет настройки под Вас, чтобы процедура была эффективна и безболезненна. Может поговорить на любую тему, начиная с сериалов заканчивая политикой. Любит домашних питомцев. Сделает Ваш день ярким и насыщенным!',
	},
	{
		id: 4,
		image: require('../../img/car4.jpg'),
		alt: 'master4',
		nameMaster: 'Ярахмедова Мадина',
		location: 'м. павелецкая',
		description:
			'Косметолог-эстетист, специалист лазерной эпиляции. Окончила Московский медицинский колледж по специальности «Лечебное дело», фельдшер скорой и неотложной помощи. Освоила программу базовой подготовки «Эстетическая косметология». Опыт в аппаратной косметологии более 5 лет.',
	},
	{
		id: 5,
		image: require('../../img/car5.jpg'),
		alt: 'master5',
		nameMaster: 'Нуманхонова Регина',
		location: 'м. Новослободская',
		description:
			'Работает в аппаратной косметологии более 7 лет. Называет себя перфекционистом и аккуратистом, поэтому доводит работу до идеального результата. Ее цель - стерильность, качество и быстрый результат. Работает на высоких мощностях, процедура проходит максимально быстро и под лёгкие беседы.',
	},
]

const Masters = () => {
	return (
		<div className={styles.cardGroup} id='Masters'>
			<h2>Косметологи с медицинским образованием и опытом более 3х лет</h2>
			<div className={styles.masters}>
				{masters.map(master => {
					return (
						<div className={styles.card} key={master.id}>
							<img
								src={master.image}
								alt={master.alt}
								width={360}
								height={360}
							/>
							<h2 className={styles.cardTitle}>{master.nameMaster}</h2>
							<span>{master.location}</span>
							<p>{master.description}</p>
						</div>
					)
				})}
			</div>
			<Button
				title='Выбрать мастера'
				link='https://n177562.yclients.com/group:147144/city:2#1'
			/>
		</div>
	)
}

export default Masters
